Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: མཽད་གལ་ཡ་ནས་སྨྲས་པ། གང་གི་ཚེ་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོས་སྨྲས་པ་དེ་ཉིད་ན་བདག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ནི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་རྗེས་སུ་ཤེས་ཀྱི། བཅོམ་ལྡན་འདས་ད་ལྟར་གང་ན་བཞུགས་པ་གང་དུ་བཞུད་ཅེས་བྱ་བ་ནི་མི་མཐོང་ངོ་། །
en: Maudgalyāyana replied, “When Venerable Mahākāśyapa was talking, I could perceive this great trichiliocosm through my magical powers, but I do not know where the Blessed One is right now, or where he has gone.

source: མི་ཤེས་སོ། །
en: I do not see him.”

source: དེ་ནས་ཉན་ཐོས་ཆེན་པོ་དེས་ཚེ་དང་ལྡན་པ་མ་འགགས་པ་ལ་སྨྲས་པ། ལྷའི་མིག་གི་ནང་ན་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱོད་ཀྱང་མཆོག་ཏུ་བསྟན་ན། བཅོམ་ལྡན་འདས་ད་ལྟར་གང་དུ་བཞུད། གང་ན་གནས། སྤྱོད་པ་ནི་ཅི་འདྲ་ཅི་འདྲར་སྤྱོད།
en: The great hearers then said to Venerable Aniruddha, “The Blessed One has said that you are foremost among those endowed with the divine eye, so please use your divine eye to see where the Blessed One has gone, where he is residing right now, and what kinds of activities he is engaging in!”

source: ཁྱོད་ཀྱི་ལྷའི་མིག་གིས་ལྟོས། མ་འགགས་པས་སྨྲས་པ། ཁོ་བོས་འཕགས་པའི་ཤེས་རབ་ཀྱི་མིག་གིས་མཐའ་ཡས་མུ་མེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་བལྟས་ན། བཅོམ་ལྡན་འདས་ད་ལྟར་གང་ན་བཞུགས། གང་དུ་བཞུད་ཅེས་བྱ་བ་དག་ཀྱང་མི་ཤེས་སོ། །
en: Aniruddha replied, “I have scrutinized countless buddha realms with my noble wisdom eye, but I do not know where the Blessed One dwells right now, or where he has gone.

source: དེས་སྨྲས་པ། ཡང་ཐ་དད་པར་ཡང་དག་པར་ཤེས་པ་ཐོབ་པའི་ཉན་ཐོས་ཀྱི་ཡེ་ཤེས་གང་ལའང་མི་འཇུག་གི །བཟོད་པ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ནི་དེ་ལ་འཇུག་གོ། །
en: He continued, “It seems the wisdom of the hearers who have achieved the special types of knowledge cannot penetrate wherever he is, but the wisdom of the bodhisattvas who have reached acceptance can penetrate there.

source: བདག་གིས་བཅོམ་ལྡན་འདས་ད་ལྟར་གང་དུ་བཞུད། གང་ན་བཞུགས་ཞེས་བྱང་ཆུབ་སེམས་དཔའ་ལ་དྲི་སྙམ་པ་དང་།
en: I think you should ask the bodhisattvas where the Blessed One has gone and where he is residing right now.”

source: དེ་ནས་ཉན་ཐོས་ཆེན་པོ་དེས་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ངོ་། །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་འདི་ལ་རིགས་ཀྱི་བུ་གཞན་ཞིག་གིས་ཕུང་པོ་བཤད་པར་བྱས་པ་དེ་ན་དགེ་སློང་དྲུག་ཅུ་ཙམ་པོ་སྟན་ལས་ལངས་ཏེ་དོང་བས།
en: As the great hearers could not see a single bodhisattva, Venerable Śāriputra said, “Venerable ones, when another noble son explained the aggregates, a group of sixty monks stood up and left.

source: ཚེ་དང་ལྡན་པ་བཅོམ་ལྡན་འདས་ཐུགས་མི་དགྱེས་ནས་བཏང་སྙོམས་ཤིང་འཕགས་པ་སངས་རྒྱས་ཀྱི་སྤྱོད་པས་རིགས་ཀྱི་བུ་དང་ཐབས་ཅིག་ཏུ་སྤྱོད་དོ། །
en: Venerable ones, this displeased the Blessed One, and he is now in equanimity practicing the conduct of a noble buddha and practicing that conduct in the company of the noble sons.

source: བདག་ཅག་ནི་རང་རང་གི་སྤྱིལ་པོར་ཞུགས་ཤིང་བསམ་གཏན་བྱ་སྙམ་སྟེ།
en: I think we should go back to our huts and practice concentration.”

source: དེ་ནས་ཉན་ཐོས་ཆེན་པོ་དེ་དག་རང་རང་གི་སྤྱིལ་པོར་ཞུགས་ནས་བསམ་གཏན་བྱེད་དོ།། །།བམ་པོ་གཉིས་པ།
en: And so, the great hearers went back to their huts and engaged in the practice of concentration.

source: དེ་ནས་དེའི་ཚེ་དེའི་དུས་ན་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་གྲངས་མེད་པ་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པའི་སེམས་ཅན་དེ། བདག་དྲང་སྲོང་གི་ཆ་བྱད་དུ་མཐོང་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། གལ་ཏེ་བདག་ཅག་དྲང་སྲོང་དུ་གྱུར་པ་ན། གང་དྲང་སྲོང་ལས་ཤིན་ཏུ་ཁྱད་པར་དུ་འཕགས་པ་དེ་བདག་ཅག་གི་མཁན་པོར་བཟུང་ངོ་ཞེས། །
en: When the beings following the Great Vehicle throughout the countless, infinite buddha realms of the ten directions saw themselves dressed as seers, they thought, “Since we have become seers, we will consider whoever is the most exalted among all the seers our preceptor.

source: བདག་ཅག་རྣམ་པར་བལྟ་བར་བྱའོ་སྙམ་པ་དེ་ཐམས་ཅད་རྙོག་པ་སེལ་བ་ཞེས་བྱ་བ་བྱེད་པ་ཅན་གྱི་གྲོང་རྡལ་ན་དྲང་སྲོང་ཆེན་པོ་ཤཱཀྱ་ཐུབ་པ་རྒས་པ། འཁོགས་པ།
en: We should seek that one out!”

source: གཏུགས་པ་རྣམས་མེ་ཏོག་དང་། འབྲས་བུ་དང་། སྨན་དང་། ཟས་དང་། སྐོམ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་མེ་ལ་གཏོར་བ་ཐག་མི་རིང་བར་མཐོང་ནས།
en: Nearby in the workers’ market town, Removing Impurities, they all saw the elderly and aged great seer Śākyamuni casting various types of incense, flowers, fruits, medicinal plants, food, and drinks into a fire.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། དྲང་སྲོང་ཆེན་པོ་འདི་ནུས་པ་ཆེན་པོ་མཐུ་ཆེན་པོ་འདིའི་མཐུས་སྣང་བ་ཆེན་པོ་འབྱུང་ངོ་། །
en: When they saw this, they thought, “This great seer is extremely adept and extremely powerful, and his power is producing a brilliant light.

source: དྲང་སྲོང་འདི་གང་ན་བ་དེ་ལོགས་སུ་ཉེ་བར་འགྲོ་ཞིང་དྲང་སྲོང་གི་བརྟུལ་ཞུགས་དང་སྤྱོད་པའི་རྗེས་སུ་བསླབ་པར་བྱའོ་སྙམ་མོ། །
en: We should go to the place where this seer resides and train in the conduct and observances of a seer!”

source: དེ་ནས་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་དྲང་སྲོང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་ཉེ་བར་དོང་ངོ་། །
en: At that moment, myriads of bodhisattva seers approached the Blessed One.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དྲང་སྲོང་ཏིང་ངེ་འཛིན་དང་། བཟོད་པ་དང་། གཟུངས་དབང་དུ་བྱས་པ་དེ་སེམས་རྩེ་གཅིག་པའི་སྟོབས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་བརྩོན་པ་དེ་ཉིད་ཀྱི་ཚེ། མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་གང་ལྷ་དང་། ཀླུ་དང་།
en: With single-pointed concentration, those bodhisattva seers who had gained control over the absorptions, acceptances, and dhāraṇīs began to perform an offering rite to the Blessed One.

source: གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་།
en: At that same moment, all of the various gods, nāgas, yakṣas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans in this Sahā world who were following the Great Vehicle approached the seer Śākyamuni dressed themselves as seers.

source: མི་དང་། མི་མ་ཡིན་པ་ལ་ལ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་དེ་ཐམས་ཅད་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་དྲང་སྲོང་ཤཱཀྱ་ཐུབ་པའི་ཐད་དུ་དེར་ཉེ་བར་དོང་ངོ་། །འཁོར་ཐམས་ཅད་དང་ལྡན་པ་དེ་བཅོམ་ལྡན་འདས་ཇི་ལྟ་བུར་སྤོས་ཀྱི་ངད་ལྡང་བའི་རི་ལ་བཞུད་ནས་དེ་ན་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་འདི་བསྟན་པའི་ཕྱིར། ཆོས་ཀྱི་འཁོར་ལོ་གཉིས་པ་ལ་ཡང་། འཇུག་པར་བཞེད་པའི་བཅོམ་ལྡན་འདས་ཀྱི་ཐུགས་སེམས་ཀྱིས་ཤེས་སོ། །
en: All those present in the assembly knew in their hearts that the Blessed One’s intention was to go to Mount Gandhamādana just as the blessed ones had before, and that he had agreed to turn the Dharma wheel a second time there in order to teach the acceptance that tames beings with the sky-colored method of perfect conduct.

source: བདག་ཅག་ནི་བཅོམ་ལྡན་འདས་ཀྱི་དོན་གྱི་ཕྱིར་ལམ་བརྒྱན་པ་སྦྱང་བར་བྱ་ཞིང་ལམ་དེས་དྲང་སྲོང་གི་མཆོག་སྤོས་ཀྱི་ངད་ལྡང་བའི་རི་ལ་ཉེ་བར་འགྲོ་བར་བྱའོ་སྙམ་སྟེ། དེ་ནས་ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་། བསྙེན་དགའ་བོ་དང་། རྒྱ་མཚོ་དང་། ནོར་མདོག་དང་།
en: They thought, “We shall ornament and clean this path for the Blessed One!

source: འཇོག་པོ་དང་།
en: This is the path that the supreme seer will travel on his way to Mount Gandhamādana.”

source: ཡིད་ཡོད་ལ་སོགས་པ་ཀླུའི་རྒྱལ་པོ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ཙམ་ལྷན་ཅིག་ཏུ་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་གསེར་དང་། དངུལ་དང་། བཻ་དཱུརྱ་དང་། ཤེལ་དང་། བྱི་རུ་དང་། ཨ་སྨ་གར་བ་དང་།
en: Then about six hundred million nāga kings who were dressed as seers, including Nanda, Upananda, Sāgara, Jewel Color, Takṣaka, and Valgu, joined together and adorned that path with rows of tāla trees made of the seven precious substances—divine precious gold, silver, beryl, crystal, coral, emerald, and white coral.

source: མུ་ས་ར་ག་ལ་བ་ལ་སོགས་པ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་ཏ་ལའི་ཕྲེང་བ་གསེར་གྱི་ཤིང་ལ་དངུལ་གྱི་ལོ་མ་དང་། མེ་ཏོག་དང་འབྲས་བུ་དང་། དངུལ་གྱི་ཤིང་ལ་གསེར་གྱི་ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་ནས་མུ་ས་ར་གལ་བའི་ཤིང་གི་བར་དུ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ལོ་མ་དང་།
en: The golden trees had silver leaves, flowers, and fruits; the silver trees had golden leaves, flowers, and fruits; and the other types of trees, up to the white coral trees, had leaves, flowers, and fruits made of the other types of precious substances.

source: མེ་ཏོག་དང་། འབྲས་བུའི་ཕྲེང་བའི་རྒྱན་གྱིས་ལམ་དེ་བརྒྱན་པར་སྤྲུལ་ཏོ། །ཤིང་ཏ་ལའི་ཕྲེང་བ་དེ་ལ་ལྷ་རྫས་ཀྱི་གོས་སྟོང་ཕྲག་བྱེ་བ་རྣམ་པ་དུ་མ་རྣམ་པ་སྣ་ཚོགས་མངོན་པར་རབ་ཏུ་འཕྱང་ངོ་། །
en: Many billions of various types of decorative fabrics were hung on those rows of tāla trees.

source: ལྷ་དེ་དག་ཀྱང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་དཀའ་ཐུབ་ཀྱི་གནས་ནས་སྤོས་ཀྱི་ངད་ལྡང་བའི་རིའི་བར་དུ་ལམ་གྱི་ཞིང་དཔག་ཚད་བཅུ་པ་སྦྱངས་སོ། །
en: The gods who were dressed as seers cleared a field ten leagues across for the path leading from the hermitage to Mount Gandhamādana.

source: ལམ་གྱི་མུ་གཉིས་སུ་ལྷ་རྫས་ཀྱི་གསེར་ནས། མུ་ས་ར་གལ་བའི་བར་དུ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སྟེགས་བུར་སྤྲུལ་ཏོ། །
en: They manifested platforms on both sides of the path that were made of all of the seven precious substances, from divine precious gold to white coral.

source: གསེར་གྱི་ཤིང་རྟ་ལ་དངུལ་གྱི་སྙིང་པོ་འཕྱང་བ་ནས། མུ་ས་ར་གལ་བའི་བར་དུ་སྨྲ་བར་བྱའོ། །འོག་ལོགས་སུ་བཻ་དཱུརྱ་བཟང་པོ་ནས། གོང་ལོགས་ཀྱི་གནས་སུ་ཤེལ་གྱི་བར་དུ་རྒྱ་ཆེན་པོས་སྨྲ་བར་བྱའོ། །
en: Their golden chariots could be described as hung with everything from nuggets of pure silver to white coral, and they were ornamented above and below with vast quantities of everything from pure beryl to white coral.

source: སྤྲིན་གྱི་ལྷའི་བུ་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་ལམ་གྱི་མུ་གཉིས་སུ་རྫིང་རྙོག་པ་མེད་པ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཐེམ་སྐས་ཅན་གྱི་རྫིང་དེ་དག་ལ་གསེར་གྱི་ཕྱེ་མ་བདལ་བ། རྫིང་དེ་དག་ལ་ཡང་ལྷ་རྫས་ཀྱི་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པུན་ད་རཱི་ཀ་དང་། ཨ་ཏི་མུག་ཏ་ཀ་དང་། ཙམ་པ་ཀ་དང་། ཨ་ཤོ་ཀ་དང་། མུ་ཙུ་ཀུན་ད་དང་། མན་འཛུ་ཤ་ཀ་དང་། བ་ཏ་ལི་དང་། པ་རི་ཤ་ཀ་དང་། གྷན་དྷ་ད་ནུ་པ་སྐ་རི་དང་།
en: The cloud deities who were dressed as seers manifested stepwells, with clear water on both sides, along the path with stairs made of the seven precious substances, and they sprinkled the stepwells with gold dust.

source: སུ་མར་དང་། ཨ་མྲ་དང་། འཛམ་བུ་དང་། མྲི་ན་ལ་དང་། མཆོག་ཏུ་དྲི་ཞིམ་པ་རྣམ་པ་སྣ་ཚོགས་སུ་མངོན་པར་སྤྲུལ་ཏོ། །ས་བླ་ན་གནམ་གྱི་གནོད་སྦྱིན་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་ལམ་སྦྱོང་བར་བྱེད་དོ། །
en: They manifested a variety of the most fragrant divine flowers in the stepwells such as blue, pink, red, and white lotus flowers, as well as rosewood, magnolia, aśoka, mucukunda, mañjūṣaka, pāṭalī, fragrant dhānuṣkārī, jasmine, mango, and rose-apple flowers.

source: གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་བུ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་ལམ་གྱི་མུ་གཉིས་ལ་ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རྒྱལ་མཚན་མཆོག་འཛིན་ཏོ། །རྒྱལ་མཚན་གྱི་མཆོག་དེ་དག་ལ་ལྷ་རྫས་ཀྱི་གོས་དང་། དོ་ཤལ་དང་། རྒྱན་རབ་ཏུ་འཕྱང་ངོ་། །
en: The terrestrial yakṣas who were dressed as seers also cleared the path, and the gods from the Heaven of Controlling Others’ Emanations held supreme banners along both sides of the path that were made of the seven divine precious substances and draped with divine fabrics, necklaces, and other ornaments.

source: འཕྲུལ་དགའི་ལྷའི་བུ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཁང་བུ་བརྩེག་མ་མངོན་པར་སྤྲུལ་ཏོ། །ཁང་བུ་བརྩེག་མ་དེ་དག་གི་ཕྱོགས་བཞི་ཀུན་ཏུ་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་བྱས་སོ། །
en: The gods from the Heaven of Enjoying Emanations who were dressed as seers manifested pavilions with four sides that were made of the seven precious substances.

source: ཁང་བུ་བརྩེག་མ་དེ་ལ་ཡང་ལྷ་རྫས་ཀྱི་དོ་ཤལ་སྣ་ཚོགས་དང་། གོས་སྣ་ཚོགས་དང་། རྒྱན་སྣ་ཚོགས་མངོན་པར་རབ་ཏུ་འཕྱང་ངོ་། །
en: A variety of divine necklaces, garments, and other ornaments were hung from those pavilions.

source: མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་ཀུན་ཏུ་གཏོར་ཏོ། །ཁང་བུ་བརྩེག་མ་དེ་ལ་ལྷ་རྫས་ཀྱི་རོལ་མོ་རྒྱ་ཆེན་པོ་ཡིད་དུ་འོང་བ་སྣ་ཚོགས་བྱུང་ངོ་། །
en: They were strewn with different types of flowers and had a beautiful and vast array of celestial instruments on them.

source: སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་རོལ་མོ་དཀྲོལ་བ་དང་། གླུའི་སྒྲ་བསྒྲགས་པ་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་སྒྲས་ཁྱབ་པར་གྱུར་ཏོ། །
en: The instruments played due to the empowering force of the Buddha and sent forth melodious tunes that pervaded this entire great trichiliocosm.

source: ཀླུའི་བུ་མོ་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་ལམ་མཛེས་པས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་དྲང་སྲོང་གི་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་ནས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཆར་ཕབ་བོ། །དགའ་ལྡན་གྱི་ལྷའི་བུ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་འདི་ལྟ་སྟེ། ལྷ་རྫས་ཀྱི་མེ་ཏོག་མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དང་། ཙམ་པ་ཀ་དང་། བ་རི་ཡ་ཏྲ་དང་། འཛོ་ཤ་དང་། འཛོ་ཤ་ཀ་ཆེན་པོ་དང་། རོ་ཙ་དང་། རོ་ཙ་ཀ་ཆེན་པོ་དང་། བལ་ལ་དང་། བལ་ལ་ཆེན་པོ་དང་། ཙཀྲ་དང་།
en: The 6,800,000 female nāgas who decorated the path had adorned themselves with all of the ornaments of a seer to perform an offering to the Blessed One, and they sent forth a shower of the various precious substances.

source: ཙཀྲ་ཆེན་པོའི་འོད་དྲི་མ་མེད་པ། འདབ་མ་བརྒྱ་པ། འདབ་མ་སྟོང་པ། འདབ་མ་བརྒྱ་སྟོང་པ།
en: Many hundreds of thousands of gods from the heaven of Tuṣita who were dressed as seers decorated the path for the Blessed One and made an offering to the Blessed One with a variety of bright and flawless divine flowers such as māndārava, mahāmāndārava, magnolia, pāriyātra, jośa, mahājośaka, roca, mahārocaka, valla, mahāvalla, cakra, and mahācakra flowers, which all had a hundred, a thousand, or a hundred thousand petals.

source: ཀུན་ནས་འོད། ཀུན་ནས་དྲི། ཀུན་ནས་རྣམ་པར་རྒྱུ་བའི་དྲི།
en: They were dazzling, fragrant, and their fragrance was everywhere.

source: རྟག་ཏུ་མེ་ཏོག་འོད་སྣང་བ། ཁ་དོག་མཐའ་མེད་པ། བལྟར་འོས་པ་མིག་གིས་མངོན་པར་དགའ་བ། རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་དོན་དང་། བཅོམ་ལྡན་འདས་ཀྱི་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ལམ་དེ་མཛེས་པར་བྱས་སོ། །
en: The flowers were always radiant, their color never faded, and they were delightful and pleasant to behold.

source: ཆར་པའི་སྤྲིན་གྱི་ལྷའི་བུ་བརྒྱ་སྟོང་དུ་མ་དག་ཀྱང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་ཆུ་ལས་སྐྱེས་པ་དང་། ཐང་ལས་སྐྱེས་པའི་མེ་ཏོག་གི་ཆར་རབ་ཏུ་ཕབ་བོ། ཀླུའི་གླང་པོ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་ཡང་དག་པར་གནས་ཤིང་འདི་ལྟ་སྟེ། མུ་ཏིག་སྔོན་པོའི་ཆར་དང་། གོ་ཤིར་ཤའི་སྙིང་པོའི་ཆར་ལ་སོགས་ཏེ། ཆར་སྣ་ཚོགས་རབ་ཏུ་ཕབ་བོ། །
en: Many hundreds of thousands of gods from the rain clouds who were dressed as seers rained showers of flowers that grow in water and in the fields, and many hundreds of thousands of nāga kings who were dressed as seers rained various showers of substances such as blue pearls and white sandalwood.

source: གང་ལ་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་སྔོན་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་ལྷའམ། ལྷའི་དབང་པོའམ། ཀླུ་འམ། ཀླུའི་དབང་པོའམ། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། གྲུལ་བུམ་དང་། གྲུལ་བུམ་གྱི་དབང་པོ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་།
en: All the gods, lords of the gods, nāgas, nāga lords, yakṣas, rākṣasas, asuras, garuḍas, kinnaras, mahoragas, pretas, piśācas, and kumbhāṇḍas, up to Śakra, Brahmā, and the guardians of the world in this great trichiliocosm who had previously given rise to the mind set on awakening and were dressed as seers, sat down to gaze upon the Blessed One’s face with unblinking eyes.

source: འཇིག་རྟེན་སྐྱོང་བའི་བར་དུ་དེ་ཐམས་ཅད་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་མེ་ཏོག་སྣ་ཚོགས་དང་། ཕྲེང་བ་སྣ་ཚོགས་དང་། དྲི་སྣ་ཚོགས་དང་། བྱུག་པ་སྣ་ཚོགས་དང་། རོལ་མོ་དཀྲོལ་བ་སྣ་ཚོགས་དང་བརྡུང་བ་དང་། གླུ་སྣ་ཚོགས་ཡོངས་སུ་བཟུང་ནས་བཅོམ་ལྡན་འདས་སྤྱན་མི་འཛུམས་པའི་ཞལ་ལ་རྣམ་པར་ལྟ་བའི་ཕྱིར་འཁོད་དོ། །གང་ལ་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ལྷའི་བུ་མོའམ། གནོད་སྦྱིན་གྱི་བུ་མོའམ།
en: They bore various flowers, garlands, perfumes, and ointments, and played musical instruments, beat drums, and sang songs.

source: ནམ་མཁའ་ལྡིང་གི་བུ་མོ་འམ། ལྷ་མ་ཡིན་གྱི་བུ་མོའམ། མིའམ་ཅིའི་བུ་མོའམ་ལྟོ་འཕྱེ་ཆེན་པོའི་བུ་མོ་དེ་ཐམས་ཅད་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་རོལ་མོ་བརྡུང་བ་དང་། དཀྲོལ་བ་དང་། གླུ་ཡོངས་སུ་བཟུང་སྟེ།
en: All the goddesses, female yakṣas, female garuḍas, female asuras, female kinnaras, and female mahoragas in this great trichiliocosm who were dressed as seers played music, sang songs, and rained gentle showers of red, white, purple, and crystalline garments to make an offering to the Blessed One.

source: དམར་པོ་དང་། དཀར་པོ་དང་། ལེ་བརྒན་དང་། ཤེལ་གྱི་ཁ་དོག་གི་གོས་ཀྱི་ཆར་ཁད་ཀྱིས་ཁད་ཀྱིས་རབ་ཏུ་ཕབ་བོ། །མིའམ་ཅིའི་བུ་མོ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་སྣ་ཚོགས་ཀྱི་ལས་ཀྱི་ཕྱིར་བརྩོན་ནོ། །
en: Many hundreds of thousands of female kinnaras who were dressed as seers also began to perform various offerings to the Blessed One.

source: ཚངས་པའི་དབང་པོ་སྔོན་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་སྟོད་ཅིང་སྤྱན་སྔར་འཁོད་དོ། །
en: Myriads of lords from the world of Brahmā who had previously given rise to the mind set on awakening and were dressed as seers praised the Blessed One and sat before him.

source: བརྒྱ་བྱིན་གྱི་དབང་པོ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་ཕྱག་འཚལ་བར་བྱེད་ཅིང་།
en: Many hundreds of thousands of lords from the world of Śakra dressed as seers prostrated to the Blessed One.

source: མིའམ་ཅིའི་དབང་པོ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་སྟོད་ཅིང་ཕྱག་འཚལ་ལོ། །
en: Many hundreds of thousands of kinnara lords dressed as seers praised the Blessed One and prostrated to him.

source: དྲི་ཟའི་དབང་པོ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་རབ་ཏུ་གསལ་བའི་སེམས་ཀྱིས་ཞལ་ལ་རྣམ་པར་ལྟའོ། །
en: Many hundreds of thousands of gandharva lords dressed as seers gazed upon the face of the Blessed One with clear minds.

source: ཀླུའི་དབང་པོ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་དུས་དང་འཐུན་པའི་ཙན་དན་གྱི་ཕྱེ་མའི་ཆར་ཆེན་པོ་རབ་ཏུ་འབེབས་སོ། །
en: Many hundreds of thousands of nāga lords dressed as seers rained great showers of yellow sandalwood powder.

source: ལྷ་མ་ཡིན་གྱི་དབང་པོ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་ཕྱོགས་བཞིར་རླུང་མཆོག་ཏུ་འཇམ་པས་ཀུན་ཏུ་རེག་པ། མཆོག་ཏུ་དྲི་ཞིམ་པ། མཆོག་ཏུ་འཇམ་པ་གཏོང་ངོ་། །
en: Many hundreds of thousands of asura lords dressed as seers raised the most gentle, soft-feeling, and fragrant winds in the four directions.

source: གནོད་སྦྱིན་གྱི་དབང་པོ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་མེ་ཏོག་གི་གདུགས་འཛིན་ཏོ། །
en: Many hundreds of thousands of yakṣa lords dressed as seers held parasols made of flowers.

source: གནོད་སྦྱིན་གྱི་དབང་པོ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་རྒན་པོར་གྱུར་ནས་གསེར་གྱི་དབྱུག་པའི་གདུགས་འཛིན་ཅིང་བཅོམ་ལྡན་འདས་ཀྱི་གཡས་ལོགས་སུ་འཁོད་དེ། བཅོམ་ལྡན་འདས་ལ་དེ་བཞིན་དུ་ལྟའོ། །
en: Many hundreds of thousands of other yakṣa lords who had become elderly sages held parasols with golden staffs and sat on the right side of the Blessed One, gazing upon him as was described before.

source: གྲུལ་བུམ་བརྒྱ་སྟོང་དུ་མའང་དྲང་སྲོང་རྒན་པོའི་ཆ་བྱད་ཀྱིས་གསེར་གྱི་དབྱུག་པའི་གདུགས་འཆང་ཞིང་བཅོམ་ལྡན་འདས་ཀྱི་གཡོན་ལོགས་སུ་འཁོད་དེ། བཅོམ་ལྡན་འདས་ལ་དེ་བཞིན་དུ་ལྟའོ། །
en: Many hundreds of thousands of kumbhāṇḍas dressed as elderly seers held parasols with golden staffs and sat on the left side of the Blessed One, gazing upon him in the same manner.

source: ནམ་མཁའ་ལྡིང་གི་དབང་པོ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་ནམ་མཁའི་དཀྱིལ་དུ་གསེར་གྱི་འཕྲེང་བ་འཕྱང་བར་གྱུར་ཏོ། །
en: Many hundreds of thousands of garuḍa lords dressed as seers hung golden garlands in the sky.

source: ལྷའི་བུ་མོ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་མེ་ཏོག་གི་ཆུན་པོའི་ཆར་ཆེན་པོ་མངོན་པར་རབ་ཏུ་འབེབས་སོ། །
en: Many hundreds of thousands of goddesses dressed as seers rained great showers of flower bouquets.

source: ཀླུའི་བུ་མོ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་མུ་ཏིག་དམར་པོའི་ཆར་མངོན་པར་རབ་ཏུ་འབེབས་སོ། །
en: Many hundreds of thousands of female nāgas dressed as seers rained showers of red pearls.

source: དྲི་ཟའི་བུ་མོ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་མུ་ཏིག་དམར་པོའི་ཆར་མངོན་པར་རབ་ཏུ་འབེབས་སོ། །
en: Many hundreds of thousands of female gandharvas dressed as seers rained showers of red pearls.

source: གནོད་སྦྱིན་གྱི་བུ་མོ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་ཙན་དན་གྱི་ཕྱེ་མའི་ཆར་མངོན་པར་རབ་ཏུ་འབེབས་སོ། །
en: Many hundreds of thousands of female yakṣas dressed as seers rained showers of sandalwood powder.

source: ལྷ་མ་ཡིན་གྱི་བུ་མོ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོག་གི་ཆ་བྱད་ཀྱིས་རྒྱན་གྱི་ཆར་མངོན་པར་རབ་ཏུ་འབེབས་སོ། །
en: Many hundreds of thousands of female asuras dressed as seers rained showers of ornaments.

source: ནམ་མཁའ་ལྡིང་གི་བུ་མོ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ཆར་མངོན་པར་རབ་ཏུ་འབེབས་སོ། །
en: Many hundreds of thousands of female garuḍas dressed as seers rained showers of gold from the Jambu River.

source: ལྟོ་འཕྱེ་ཆེན་པོའི་བུ་མོ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་ནམ་མཁའི་དཀྱིལ་བརྒྱན་པར་བྱེད་དོ། །
en: Many hundreds of thousands of female mahoragas dressed as seers ornamented the sky.

source: སའི་གནོད་སྦྱིན་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་དབྱངས་གཏོང་བར་བྱེད་དོ། །
en: Many hundreds of thousands of terrestrial female yakṣas dressed as seers played melodious tunes.

source: བར་སྣང་གི་གནོད་སྦྱིན་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་ནམ་མཁའ་ལ་འཕྱེན་ཏོ། །བདུད་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་ལྷུང་ལྷུང་ལྡེགས་ཀྱི་སྒྲ་འབྱིན་པ་ལ་འཇུག་གོ། །
en: Many hundreds of thousands of female yakṣas of the mid-regions that were dressed as seers roamed through space, and many hundreds of thousands of māras dressed as seers started to lament.

source: དྲང་སྲོང་ལྷ་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་རང་བཞིན་གྱིས་བརྟན་པའི་བརྟུལ་ཞུགས་ཡང་དག་པར་སྤྱོད་པ་དང་། དྲང་སྲོང་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་རང་བཞིན་གྱིས་བརྟན་པའི་བརྟུལ་ཞུགས་ཡང་དག་པར་སྤྱོད་པ་དག་ལྷ་རྫས་ཀྱི་མེ་ཏོག་མན་དཱ་ར་བ་ཆེན་པོ་བླངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་དོན་གྱི་ཕྱིར་རྙོག་པ་སེལ་བ་ནས་སྤོས་ཀྱི་ངད་ལྡང་བའི་རིའི་བར་དུ་མཚམས་སྦྱོར་བའི་ཆར་རབ་ཏུ་འབྱིན་ཏོ། །དེ་ནས་བཅོམ་ལྡན་འདས་བཞུད་པའི་ཞབས་ཀྱིས་མེ་ཏོག་གི་སྙིང་པོ་ཀུན་ཏུ་གནོན་པར་གྱུར་ཏོ། །
en: Divine seers numbering 840,000, whose conduct and observances were naturally steadfast, and eighty-four thousand seers whose conduct and observances were naturally steadfast, picked up celestial mahāmāndārava flowers and showered them for the Blessed One at each step of the way between Removing Impurities and Mount Gandhamādana so that the Blessed One’s footsteps would always fall on the center of a flower.

source: ལྷའི་བུ་ཉི་མ་དང་ཟླ་བ་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་མེ་ཏོག་གི་ཆུན་པོའི་ཆར་མངོན་པར་རབ་ཏུ་འབེབས་སོ། །
en: Many hundreds of thousands of solar and lunar gods dressed as seers rained showers of flower bouquets.

source: དྲི་ཟ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་ཡང་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་རོལ་མོ་དཀྲོལ་བས་དྲང་སྲོང་ཐུབ་པའི་སྐུ་ལ་འོད་ཟེར་བྱེ་བ་བརྒྱ་སྟོང་འབྱུང་ངོ་། །
en: Myriad gandharvas dressed as seers played music, and a trillion light rays illuminated the body of the sage Seer.

source: དེ་ནས་ལྷ་ཡོན་ཏན་ཅན་ཞེས་བྱ་བ་སྤོས་ཀྱི་ངད་ལྡང་བའི་རི་ལ་གནས་པ་ལྷ་བྲན་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་དང་ལྷན་ཅིག་ཏུ་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་འཚལ་ནས། བཅོམ་ལྡན་འདས་ལ་མགྲིན་གཅིག་ཏུ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །སེམས་ཅན་མི་སྲུན་གྲོལ་བྱེད་རྐང་གཉིས་མཆོག །མཉེས་དཀའ་རྒྱལ་བ་གཟུངས་ངན་འདྲེན་མཛད་ཅིང་། །སྡུག་བསྔལ་གཟིར་ལ་བདེ་བའི་མཆོག་སྦྱིན་པ། །རྒྱལ་བ་རྐང་གཉིས་དམ་པ་འདིར་གཤེགས་གསོལ། །
en: The god Endowed with Qualities, who lived on Mount Gandhamādana, and 840,000 temple servants dressed as seers prostrated toward the Blessed One with their palms joined and praised him in unison with these verses: “Liberator of wicked beings, foremost among humans, Victor, so hard to satisfy, leader of feeble beings, You grant supreme happiness to those who are tormented by suffering— Victor, supreme human, please come to this place!

source: སྲེད་པ་རབ་སྤངས་རྣམ་ཐར་གསུམ་སྟོན་ཅིང་། །
en: “You have abandoned craving and you reveal the three liberations.

source: འགྲོ་ལ་དུས་གསུམ་ནང་ན་ཡེ་ཤེས་ཀྱིས། །བསླབ་པ་གསུམ་སྟོན་དྲི་མ་གསུམ་སྤངས་པ། །ཁམས་གསུམ་ལས་འདས་ཐུབ་པ་འདིར་གཤེགས་གསོལ། །
en: With your wisdom, you teach the three trainings to beings In the three times and eliminate the three types of defilement— Sage who has transcended the three realms, please come to this place!

source: འགྲོ་ལ་ཕྱིན་ཅི་ལོག་བཞི་རྣམ་པར་གྲོལ། །འཁོར་བཞི་དག་གིས་ཞབས་ལ་བསྙེན་བཀུར་ཞིང་། །འགྲོ་ལ་འཕགས་པའི་བདེན་བཞི་རབ་སྟོན་པ། །ཟླ་བ་བས་ཀྱང་ལྷག་པ་འདིར་གཤེགས་གསོལ། །
en: “You liberate beings from the four types of wrong views, The four assemblies worship at your feet, And you teach the four noble truths to beings— You who are superior to the moon, please come to this place!
